УправлениеРассылками/src/InformationRegisters/Очередь/Очередь.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Очередь</name>
  <resources>
    <name>УчетнаяЗаписьЭП</name>
    <type>
      <types>CatalogRef.УчётныеЗаписиЭП</types>
    </type>
  </resources>
  <attributes>
    <name>Реквизит</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Рассылка</name>
    <type>
      <types>DocumentRef.Рассылка</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УправлениеРассылками/src/CommonModules/Рассылка/Module.bsl
// отправка писем из очереци
Процедура ОтправкаПисемИзОчереди() Экспорт
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!
	ДатаОтправки = Дата(ТекущаяДата());
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 5
		|	Очередь.Рассылка КАК Рассылка,
		|	Очередь.Контрагент КАК Контрагент,
		|	Очередь.УчетнаяЗаписьЭП КАК УчетнаяЗаписьЭП,
		|	Очередь.ДатаОтправки КАК ДатаОтправки
		|ИЗ
		|	РегистрСведений.Очередь КАК Очередь
		|ГДЕ
		|	Очередь.ДатаОтправки <= &ДатаОтправки
		|ДЛЯ ИЗМЕНЕНИЯ
		|УПОРЯДОЧИТЬ ПО
		|	ДатаОтправки,
		|	Рассылка,
		|	Контрагент,
		|	УчетнаяЗаписьЭП";
	
	Запрос.УстановитьПараметр("ДатаОтправки", ДатаОтправки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Сообщить(ВыборкаДетальныеЗаписи.ИмяПоля)
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
КонецПроцедуры
